# Dotfiles dependencies — install with:
#   cd ~/.dotfiles && brew bundle install

# --- Shell core ---
brew "zsh"
brew "starship"
brew "zoxide"
brew "atuin"
brew "carapace"
brew "fzf"
brew "direnv"      # per-directory env vars (.envrc)

# --- Modern CLI replacements ---
brew "eza"         # ls
brew "bat"         # cat
brew "fd"          # find
brew "ripgrep"     # grep
brew "bottom"      # top (btm)
brew "gping"       # ping with graph

# --- tmux / sessions ---
brew "sesh"        # smart tmux session manager (fzf + zoxide)

# --- Git ---
brew "lazygit"     # git TUI
brew "git-delta"   # syntax-highlighted git pager (delta)

# --- Editor ---
brew "neovim"

# --- Python tooling ---
brew "uv"

# --- Secrets (sops + age encrypted env) ---
brew "sops"        # encrypted secrets management
brew "age"         # modern encryption backend for sops

# --- Cloud / Infra ---
brew "awscli"
brew "kubectl"
brew "helm"
brew "kubectx"     # provides kubectx + kubens
brew "stern"       # better multi-pod logs
brew "k9s"

# --- Teclado / hotkeys (Keychron K0 Max) ---
# OJO en una máquina nueva: Homebrew bloquea taps de terceros. Antes del
# bundle hay que correr una vez:  brew trust koekeishiya/formulae
tap "koekeishiya/formulae"
brew "skhd"        # hotkey daemon: F13/F14 del numpad -> abrir apps

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"
